In [1]:
import pandas as pd
from pandas import Series, DataFrame
# double importing allows us flexibility in writing code

###  Series Review

### Make a Series from scores_list

In [31]:
scores_list = [54, 22, 19, 73, 80]
scores_series = None
scores_series

# what name do we use for the  0, 1, 2, ... ??       A:  index
# what name do we use for the  54, 22, 19, .... ??   A:  value

0    54
1    22
2    19
3    73
4    80
dtype: int64

### We can make a series from a dictionary

In [32]:
# imagine we hire students and track their weekly hours
week1 = Series({"Rita":5, "Therese":3, "Janice": 6})
week2 = Series({"Rita":3, "Therese":7, "Janice": 4})
week3 = Series({"Therese":5, "Janice":5, "Rita": 8})   # wrong order!
print(week1)
print(week2)
print(week3)

Rita       5
Therese    3
Janice     6
dtype: int64
Rita       3
Therese    7
Janice     4
dtype: int64
Therese    5
Janice     5
Rita       8
dtype: int64

###  For everyone in Week 1, add 3 to their hours

In [9]:
week1 = week1 # change this
week1

Rita       14
Therese    12
Janice     15
dtype: int64

### Make a dataframe that stores everyone's total hours

In [33]:
total_hours = None
total_hours
# the data in week 3 had its indices in a different order

Janice     15
Rita       16
Therese    15
dtype: int64

### What is week1 / week3 ?

In [34]:
week1 / week3
# notice that we didn't have to worry about the order of indices

Janice     1.200
Rita       0.625
Therese    0.600
dtype: float64

###  What type of values are stored in  week1 > week2?

In [35]:
print(week1)
print(week2)
week1 > week2 # indices are ordered the same

# Answer here:

Rita       5
Therese    3
Janice     6
dtype: int64
Rita       3
Therese    7
Janice     4
dtype: int64

Rita        True
Therese    False
Janice      True
dtype: bool

###  What is week1 > week3?

In [7]:
print(week1)
print(week3)
# week1 > week3 # indices not in same order

Rita       8
Therese    6
Janice     9
dtype: int64
Therese    5
Janice     5
Rita       8
dtype: int64


# Lecture 28:  Pandas 2 - DataFrames


Learning Objectives:
- Create a DataFrame from 
 - a dictionary of Series, lists, or dicts
 - a list of Series, lists, dicts
- Select a column, row, cell, or rectangular region of a DataFrame
- Convert CSV files into DataFrames and DataFrames into CSV Files
- Access the head or tail of a DataFrame


### Data Frames store 2-dimensional data in tables

## 1. Create a DataFrame a variety of ways
### from a dictionary of Series

In [17]:
names = Series(["Alice", "Bob", "Cindy", "Dan"])
scores = Series([6, 7, 8, 9])

# to make a dictionary of Series, need to write column names for the keys
DataFrame({
    "Player name": ???,
    "Score": ???
})

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

### Create a DataFrame from dictionary of lists

In [18]:
name_list = ["Alice", "Bob", "Cindy", "Dan"]
score_list = [6, 7, 8, 9]
# this is the same as above, reminding us that Series act like lists
DataFrame({
    "???": name_list,
    "???": score_list
})

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

### Create a DataFrame from dictionary of dicts
We need to make up keys to match the things in each column

In [20]:
data = {
    "???": {0: "Alice", 1: "Bob", 2: "Cindy", 3: "Dan"},
    "???": {0: 6, 1: 7, 2: 8, 3: 9}
}
DataFrame(data)

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

### Create a DataFrame from list of lists
We have to add the column names, we do this with `columns = [name1, name2, ....]`

In [16]:
data = [
    ["Alice", 6],
    ["Bob", 7],
    ["Cindy", 8],
    ["Dan", 9]
]
data
DataFrame(data, columns = [])

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

### Create a DataFrame from list of dicts

In [21]:
data = [
    {"Player name": "Alice", "Score": 6},
    {"Player name": "Bob", "Score": 7},
    {"Player name": "Cindy", "Score": 8},
    {"Player name": "Dan", "Score": 9}
]
# create the data frame

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

### Same as above, but Name the Rows
We can use `index = [name1, name2, ...]` to rename the index of each row

In [23]:
# 
data = [
    {"Player name": "Alice", "Score": 6},
    {"Player name": "Bob", "Score": 7},
    {"Player name": "Cindy", "Score": 8},
    {"Player name": "Dan", "Score": 9}
]

  Player name  Score
A       Alice      6
B         Bob      7
C       Cindy      8
D         Dan      9

### Naming the Columns

In [24]:
data = [
    ["Alice", 6],
    ["Bob", 7],
    ["Cindy", 8],
    ["Dan", 9]
]

  Player name  Score
0       Alice      6
1         Bob      7
2       Cindy      8
3         Dan      9

In [1]:
# You try: 
# Make a DataFrame of 4 people you know with different ages
# Give names to both the columns and rows
ages = None
ages

In [ ]:
# Share how you did with this with your neighbor
# If you both did it the same way, try it a different way

## 2. Select a column, row, cell, or rectangular region of a DataFrame
### Data lookup: Series
- `s.loc[X]`   <- lookup by pandas index
- `s.iloc[X]`  <- lookup by integer position

In [36]:
hours = Series({"Alice":6, "Bob":7, "Cindy":8, "Dan":9})
hours

Alice    6
Bob      7
Cindy    8
Dan      9
dtype: int64

In [37]:
hours.loc["Bob"] #Series index

7

In [38]:
hours.iloc[2] #Series integer position

8

In [39]:
hours["Cindy"] #Series index

8

###  Data lookup: DataFrame


- `d.loc[r]`     lookup ROW by pandas ROW index
- `d.iloc[r]`    lookup ROW by ROW integer position
- `d[c]`         lookup COL by COL index
- `d.loc[r, c]`  lookup by ROW index and COL index
- `d.iloc[r, c]`  lookup by ROW integer position and COL integer position

In [26]:
# we often call the object that we make df
data = [
    ["Alice", 6],
    ["Bob", 7],
    ["Cindy", 8],
    ["Dan", 9]
]
df = DataFrame(data, index=["A", "B", "C", "D"], columns = ["Player name", "Score"])
df

  Player name  Score
A       Alice      6
B         Bob      7
C       Cindy      8
D         Dan      9

### What are 3 different ways of accessing row D?

In [40]:
print()
print()
print()

Player name    Dan
Score            9
Name: D, dtype: object
Player name    Dan
Score            9
Name: D, dtype: object
Player name    Dan
Score            9
Name: D, dtype: object

In [41]:
df

  Player name  Score
A       Alice      6
B         Bob      7
C       Cindy      8
D         Dan      9

### What is the only  way to access a column?

A    Alice
B      Bob
C    Cindy
D      Dan
Name: Player name, dtype: object

### What are 3 different ways to access a single cell?

In [43]:
df

  Player name  Score
A       Alice      6
B         Bob      7
C       Cindy      8
D         Dan      9

In [29]:
# How to access the string "Cindy" ?
print()
print()
print()

Cindy
Cindy
Cindy

## How to set values for a specific entry?

- `d.loc[r, c] = new_val`
- `d.iloc[r, c] = new_val`

In [30]:
#change player D's name

df

  Player name  Score
A       Alice      6
B         Bob      7
C       Cindy      8
D      Bianca      9

In [31]:
# then add 3 to that player's score using .loc

df

  Player name  Score
A       Alice      6
B         Bob     10
C       Cindy      8
D      Bianca      9

In [32]:
# add 7 to a different player's score using .iloc
df

  Player name  Score
A       Alice      6
B         Bob     10
C       Cindy      8
D      Bianca     11

### Find the max score and the mean score

In [33]:
# find the max and mean of the "Score" column
print()

11 8.75

##  3.  Slicing a DataFrame

- `df.iloc[ROW_SLICE, COL_SLICE]` <- make a rectangular slice from the DataFrame using integer positions
- `df.loc[ROW_SLICE, COL_SLICE]` <- make a rectangular slice from the DataFrame using index

In [44]:
df.iloc[1:3, 0:2]

  Player name  Score
B         Bob      7
C       Cindy      8

In [45]:
df.loc["B":"C", "Player name":"Score"] # notice that this way is inclusive of endpoints

  Player name  Score
B         Bob      7
C       Cindy      8

## Set values for sliced DataFrame

- `d.loc[ROW_SLICE, COL_SLICE] = new_val` <- set value by ROW INDEX and COL INDEX
- `d.iloc[ROW_SLICE, COL_SLICE] = new_val` <- set value by ROW Integer position and COL Integer position

In [36]:
df

  Player name  Score
A       Alice      6
B         Bob     10
C       Cindy      8
D      Bianca     11

In [37]:
df.loc["B":"C", "Score"] += 5
df

  Player name  Score
A       Alice      6
B         Bob     15
C       Cindy     13
D      Bianca     11

### Pandas allows slicing of non-contiguous columns

In [47]:
# just get Player name for Index B and D
df.loc[["B", "D"],"Player name"]

B    Bob
D    Dan
Name: Player name, dtype: object

In [48]:
# add 2 to the people in rows B and D

## Boolean indexing on a DataFrame

- `d[BOOL SERIES]`  <- makes a new DF of all rows that lined up were True

In [40]:
df

  Player name  Score
A       Alice      6
B         Bob     17
C       Cindy     13
D      Bianca     13

### make a Series of Booleans based on Score >= 15

In [49]:
b = df["Score"] >= 15
b

A    False
B    False
C    False
D    False
Name: Score, dtype: bool

### use b to slice the DataFrame
if b is true, include this row in the new df

In [50]:
df[b]

Empty DataFrame
Columns: [Player name, Score]
Index: []

### do the last two things in a single step

Empty DataFrame
Columns: [Player name, Score]
Index: []

## 4. Creating DataFrame from csv

In [52]:
# it's that easy!  
df = pd.read_csv("IMDB-Movie-Data.csv")
df

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
...,...,...,...,...,...,...,...,...,...
993,993,Secret in Their Eyes,"Crime,Drama,Mystery",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,0
994,994,Hostel: Part II,Horror,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,17.54
995,995,Step Up 2: The Streets,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,996,Search Party,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,997,Nine Lives,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

###   View the first few lines of the DataFrame
- `.head(n)` gets the first n lines, 5 is the default

In [54]:
df.head()

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02

### get the first 2 rows

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M

###   View the first few lines of the DataFrame
- `.tail(n)` gets the last n lines, 5 is the default

In [57]:
df.tail()

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
993,993,Secret in Their Eyes,"Crime,Drama,Mystery",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,0
994,994,Hostel: Part II,Horror,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,17.54
995,995,Step Up 2: The Streets,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,996,Search Party,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,997,Nine Lives,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

In [58]:
# get the last 3 rows

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
995,995,Step Up 2: The Streets,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,996,Search Party,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,997,Nine Lives,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

### what is the min and max year in our DataFrame?

In [59]:
print()

2006	2016

In [67]:
### what rows correspond to movies whose title contains "Harry" ?

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
114,114,Harry Potter and the Deathly Hallows: Part 2,"Adventure,Drama,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, M...",2011,130,8.1,380.96
314,314,Harry Potter and the Order of the Phoenix,"Adventure,Family,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, B...",2007,138,7.5,292
417,417,Harry Potter and the Deathly Hallows: Part 1,"Adventure,Family,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, B...",2010,146,7.7,294.98
472,472,Harry Potter and the Half-Blood Prince,"Adventure,Family,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, M...",2009,153,7.5,301.96

### what is the movie at index 6 ?

In [51]:
df.iloc[6]

Index                                                       6
Title                                              La La Land
Genre                                      Comedy,Drama,Music
Director                                      Damien Chazelle
Cast        Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....
Year                                                     2016
Runtime                                                   128
Rating                                                    8.3
Revenue                                               151.06M
Name: 6, dtype: object

In [52]:
df

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
...,...,...,...,...,...,...,...,...,...
993,993,Secret in Their Eyes,"Crime,Drama,Mystery",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,0
994,994,Hostel: Part II,Horror,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,17.54
995,995,Step Up 2: The Streets,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,996,Search Party,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,997,Nine Lives,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

## Notice that there are two index columns
- That happened because when you write a csv from pandas to a file, it writes a new index column
- So if the dataFrame already contains an index, you are going to get two index columns
- Let's fix that problem

### How can you use slicing to get just columns with Title and Year?

In [70]:
df3 = df[["Title", "Year"]]
df3
# notice that this does not have the 'index' column

                       Title  Year
0    Guardians of the Galaxy  2014
1                 Prometheus  2012
2                      Split  2016
3                       Sing  2016
4              Suicide Squad  2016
..                       ...   ...
993     Secret in Their Eyes  2015
994          Hostel: Part II  2007
995   Step Up 2: The Streets  2008
996             Search Party  2014
997               Nine Lives  2016

[998 rows x 2 columns]

### How can you use slicing to get rid of the first column?

In [71]:
df2 =  df.iloc[:, 1:] #all the rows, not column 0
df2

,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
...,...,...,...,...,...,...,...,...
993,Secret in Their Eyes,"Crime,Drama,Mystery",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,0
994,Hostel: Part II,Horror,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,17.54
995,Step Up 2: The Streets,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,Search Party,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,Nine Lives,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

### Wrong way to write a df to a csv file

In [55]:
df2.to_csv("wrong_movies.csv")

### Correct way to write a df to a csv file

In [56]:
df2.to_csv("better_movies.csv", index = False)

## 5. Practice on your own.....Data Analysis with Data Frames

In [73]:
# What are all the movies that have a runtime greater than the mean? 
long_movies = None
long_movies.head()

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
6,6,La La Land,"Comedy,Drama,Music",Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,151.06M

In [76]:
# of these movies, what was the min rating? 
min_rating = None
min_rating

3.2

In [77]:
# which long movies had this min rating?

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
646,646,Tall Men,"Fantasy,Horror,Thriller",Jonathan Holbrook,"Dan Crisafulli, Kay Whitney, Richard Garcia, P...",2016,133,3.2,0

### what are all long_movies with someone in the cast named "Emma" ?

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
6,6,La La Land,"Comedy,Drama,Music",Damien Chazelle,"Ryan Gosling, Emma Stone, Rosemarie DeWitt, J....",2016,128,8.3,151.06M
92,92,The Help,Drama,Tate Taylor,"Emma Stone, Viola Davis, Octavia Spencer, Bryc...",2011,146,8.1,169.71M
114,114,Harry Potter and the Deathly Hallows: Part 2,"Adventure,Drama,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, M...",2011,130,8.1,380.96
157,157,"Crazy, Stupid, Love.","Comedy,Drama,Romance",Glenn Ficarra,"Steve Carell, Ryan Gosling, Julianne Moore, Em...",2011,118,7.4,84.24
253,253,The Amazing Spider-Man 2,"Action,Adventure,Sci-Fi",Marc Webb,"Andrew Garfield, Emma Stone, Jamie Foxx, Paul ...",2014,142,6.7,202.85
314,314,Harry Potter and the Order of the Phoenix,"Adventure,Family,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, B...",2007,138,7.5,292
367,367,The Amazing Spider-Man,"Action,Adventure",Marc Webb,"Andrew Garfield, Emma Stone, Rhys Ifans, Irrfa...",2012,136,7.0,262.03
417,417,Harry Potter and the Deathly Hallows: Part 1,"Adventure,Family,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, B...",2010,146,7.7,294.98
472,472,Harry Potter and the Half-Blood Prince,"Adventure,Family,Fantasy",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, M...",2009,153,7.5,301.96
609,609,Beautiful Creatures,"Drama,Fantasy,Romance",Richard LaGravenese,"Alice Englert, Viola Davis, Emma Thompson,Alde...",2013,124,6.2,19.45
717,717,Noah,"Action,Adventure,Drama",Darren Aronofsky,"Russell Crowe, Jennifer Connelly, Anthony Hopk...",2014,138,5.8,101.16M
879,879,Saving Mr. Banks,"Biography,Comedy,Drama",John Lee Hancock,"Emma Thompson, Tom Hanks, Annie Rose Buckley, ...",2013,125,7.5,83.3

In [64]:
# What is the title of the shortest movie?

792    Ma vie de Courgette
Name: Title, dtype: object

In [80]:

# What movie had the highest revenue?
# df["Revnue"].max() did not work
# we need to clean our data

def format_revenue(revenue):
    #TODO: Check the last character of the string
    if type(revenue) == float: # need this in here if we run code multiple times
        return revenue
    if revenue[-1] == 'M':
        return float(revenue[:-1])
    elif revenue[-1] == 'K':
        return float(revenue[:-1])
    else:
        return float(revenue)

In [82]:
# What movie had the highest revenue?
revenue = df["Revenue"].apply(format_revenue) # apply a function to a column
print(revenue.head())
max_revenue = revenue.max()

# make a copy of our df
rev_df = df.copy()
rev_df["Rev as fl"] = revenue
rev_df[rev_df["Rev as fl"] == max_revenue]

0    333.13
1    126.46
2    138.12
3    270.32
4    325.02
Name: Revenue, dtype: float64

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue,Rev as fl
50,50,Star Wars: Episode VII - The Force Awakens,"Action,Adventure,Fantasy",J.J. Abrams,"Daisy Ridley, John Boyega, Oscar Isaac, Domhna...",2015,136,8.1,936.63,936.63

In [67]:
# For a certain director, what is the average runtime?

126.75

In [68]:
df

,Index,Title,Genre,Director,Cast,Year,Runtime,Rating,Revenue
0,0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,333.13
1,1,Prometheus,"Adventure,Mystery,Sci-Fi",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael ...",2012,124,7.0,126.46M
2,2,Split,"Horror,Thriller",M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,138.12M
3,3,Sing,"Animation,Comedy,Family",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,270.32
4,4,Suicide Squad,"Action,Adventure,Fantasy",David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,325.02
...,...,...,...,...,...,...,...,...,...
993,993,Secret in Their Eyes,"Crime,Drama,Mystery",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,0
994,994,Hostel: Part II,Horror,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,17.54
995,995,Step Up 2: The Streets,"Drama,Music,Romance",Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,58.01
996,996,Search Party,"Adventure,Comedy",Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,0
997,997,Nine Lives,"Comedy,Family,Fantasy",Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,19.64

In [69]:
# which director had the highest average rating? 

# one way is to make a python dict of director, list of ratings
director_dict = dict()

# make the dictionary: key is director, value is list of ratings
for i in range(len(df)):
    director = df.loc[i, "Director"]
    rating = df.loc[i, "Rating"]
    #print(i, director, rating)
    if director not in director_dict:
        director_dict[director] = []
    director_dict[director].append(rating)

# make a ratings dict key is directory, value is average
# only include directors with > 4 movies
ratings_dict = {k:sum(v)/len(v) for (k,v) in director_dict.items() if len(v) > 4}

#sort a dict by values
dict(sorted(ratings_dict.items(), key=lambda t:t[-1], reverse=True))

{'Christopher Nolan': 8.680000000000001,
 'Martin Scorsese': 7.92,
 'David Fincher': 7.8199999999999985,
 'Denis Villeneuve': 7.76,
 'J.J. Abrams': 7.58,
 'David Yates': 7.433333333333334,
 'Danny Boyle': 7.42,
 'Antoine Fuqua': 7.040000000000001,
 'Zack Snyder': 7.040000000000001,
 'Woody Allen': 7.019999999999999,
 'Peter Berg': 6.860000000000001,
 'Ridley Scott': 6.85,
 'Justin Lin': 6.82,
 'Michael Bay': 6.483333333333334,
 'Paul W.S. Anderson': 5.766666666666666,
 'M. Night Shyamalan': 5.533333333333332}

In [84]:
# Extra Practice: Make up some of your own questions about the movies